#### Terraform Validation & Plan Results
* Terraform Version 📎`1.6.6`
* Working Directory 📂`./code/infra`
* Terraform Initialization ⚙️`success`
* Terraform Validation 🤖`success`
* Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[1mdata.azurerm_subnet.subnet: Reading...[0m[0m
[0m[1mdata.azurerm_resource_group.resource_group: Reading...[0m[0m
[0m[1mdata.azurerm_client_config.current: Reading...[0m[0m
[0m[1mdata.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iYWFhNzg4NS05MGQ5LTQ5YTYtYmZmMC1jMTJlYzczOGJmOWI7b2JqZWN0SWQ9ZTlmOGE5ZDUtMmI0ZC00ZDY1LTg1ZTMtZGNiNmVmNDk4OGJlO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mdata.azurerm_resource_group.resource_group: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg][0m
[0m[1mazurerm_user_assigned_identity.user_assigned_identity: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/dpml-dev-uai001][0m
[0m[1mazurerm_key_vault.key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.KeyVault/vaults/dpml-dev-kv001][0m
[0m[1mazurerm_container_registry.container_registry: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.ContainerRegistry/registries/dpmldevacr001][0m
[0m[1mazurerm_log_analytics_workspace.log_analytics_workspace: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.OperationalInsights/workspaces/dpml-dev-log001][0m
[0m[1mazurerm_storage_account.storage: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Storage/storageAccounts/dpmldevst001][0m
[0m[1mdata.azurerm_subnet.subnet: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-logic-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-logic-vnet001/subnets/PeSubnet][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_log_analytics_workspace: Reading...[0m[0m
[0m[1mazurerm_application_insights.application_insights: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Insights/components/dpml-dev-ai001][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_log_analytics_workspace: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.OperationalInsights/workspaces/dpml-dev-log001][0m
[0m[1mazurerm_monitor_diagnostic_setting.diagnostic_setting_log_analytics_workspace: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.OperationalInsights/workspaces/dpml-dev-log001|logAnalytics][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_container_registry: Reading...[0m[0m
[0m[1mazurerm_private_endpoint.container_registry_private_endpoint: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Network/privateEndpoints/dpmldevacr001-pe][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_container_registry: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.ContainerRegistry/registries/dpmldevacr001][0m
[0m[1mazurerm_monitor_diagnostic_setting.diagnostic_setting_container_registry: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.ContainerRegistry/registries/dpmldevacr001|logAnalytics][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault: Reading...[0m[0m
[0m[1mazurerm_private_endpoint.key_vault_private_endpoint: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Network/privateEndpoints/dpml-dev-kv001-pe][0m
[0m[1mazurerm_role_assignment.uai_role_assignment_resource_group_reader: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Authorization/roleAssignments/3775fde6-f3c4-5e17-479b-cf3f28b095be][0m
[0m[1mazurerm_role_assignment.uai_role_assignment_key_vault_contributor: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.KeyVault/vaults/dpml-dev-kv001/providers/Microsoft.Authorization/roleAssignments/869bbb67-dec0-1553-023d-c99679a889bb][0m
[0m[1mazurerm_role_assignment.uai_role_assignment_key_vault_administrator: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.KeyVault/vaults/dpml-dev-kv001/providers/Microsoft.Authorization/roleAssignments/04aeaeeb-190f-ce94-0012-ba1be74d5199][0m
[0m[1mazurerm_role_assignment.uai_role_assignment_container_registry_acrpush: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.ContainerRegistry/registries/dpmldevacr001/providers/Microsoft.Authorization/roleAssignments/f1eebaa4-387f-b229-ee24-336438fc10c2][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.KeyVault/vaults/dpml-dev-kv001][0m
[0m[1mazurerm_role_assignment.uai_role_assignment_container_registry_contributor: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.ContainerRegistry/registries/dpmldevacr001/providers/Microsoft.Authorization/roleAssignments/9050a203-1d4b-f20d-b940-0c2273a321b4][0m
[0m[1mazurerm_role_assignment.uai_role_assignment_container_registry_acrpull: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.ContainerRegistry/registries/dpmldevacr001/providers/Microsoft.Authorization/roleAssignments/ab0e0888-ab0b-6466-20e8-cf88c3ad8ff7][0m
[0m[1mazurerm_monitor_diagnostic_setting.diagnostic_setting_key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.KeyVault/vaults/dpml-dev-kv001|logAnalytics][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_application_insights: Reading...[0m[0m
[0m[1mazurerm_role_assignment.uai_role_assignment_application_insights_contributor: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Insights/components/dpml-dev-ai001/providers/Microsoft.Authorization/roleAssignments/117a660f-c0ec-a0bd-836f-11b4c4e8ff7a][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_application_insights: Read complete after 1s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Insights/components/dpml-dev-ai001][0m
[0m[1mazurerm_monitor_diagnostic_setting.diagnostic_setting_application_insights: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Insights/components/dpml-dev-ai001|logAnalytics][0m
[0m[1mazurerm_private_endpoint.storage_private_endpoint_blob: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Network/privateEndpoints/dpmldevst001-blob-pe][0m
[0m[1mazurerm_role_assignment.uai_role_assignment_storage_blob_contributor: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Storage/storageAccounts/dpmldevst001/providers/Microsoft.Authorization/roleAssignments/62a30f1e-405a-ce11-f44d-48260053eb6c][0m
[0m[1mazurerm_role_assignment.uai_role_assignment_storage_table_contributor: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Storage/storageAccounts/dpmldevst001/providers/Microsoft.Authorization/roleAssignments/a1e24784-958e-b9a2-8efb-a99fa34dd2dd][0m
[0m[1mazurerm_storage_management_policy.storage_management_policy: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Storage/storageAccounts/dpmldevst001/managementPolicies/default][0m
[0m[1mazurerm_role_assignment.current_roleassignment_storage: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Storage/storageAccounts/dpmldevst001/providers/Microsoft.Authorization/roleAssignments/edae7e24-f1b0-b3cf-7f9f-5fef77f0e997][0m
[0m[1mazurerm_role_assignment.uai_role_assignment_storage_file_data_priviliged_contributor: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Storage/storageAccounts/dpmldevst001/providers/Microsoft.Authorization/roleAssignments/45d45e6b-0b7d-9f12-018c-f6e55403207d][0m
[0m[1mazurerm_private_endpoint.storage_private_endpoint_queue: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Network/privateEndpoints/dpmldevst001-queue-pe][0m
[0m[1mazurerm_role_assignment.uai_role_assignment_storage_contributor: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Storage/storageAccounts/dpmldevst001/providers/Microsoft.Authorization/roleAssignments/83510c70-ab6c-3c1f-07d1-bf8f8bb880d9][0m
[0m[1mazurerm_private_endpoint.storage_private_endpoint_table: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Network/privateEndpoints/dpmldevst001-table-pe][0m
[0m[1mazurerm_private_endpoint.storage_private_endpoint_file: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Network/privateEndpoints/dpmldevst001-file-pe][0m
[0m[1mazurerm_machine_learning_workspace.machine_learning_workspace: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.MachineLearningServices/workspaces/dpml-dev-mlw001][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_machine_learning_workspace: Reading...[0m[0m
[0m[1mazapi_update_resource.machine_learning_managed_network: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.MachineLearningServices/workspaces/dpml-dev-mlw001][0m
[0m[1mazurerm_role_assignment.uai_role_assignment_machine_learning_workspace_contributor: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.MachineLearningServices/workspaces/dpml-dev-mlw001/providers/Microsoft.Authorization/roleAssignments/a1447019-0c42-3a84-ad46-fe6bbca370f5][0m
[0m[1mazurerm_private_endpoint.machine_learning_workspace_private_endpoint: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Network/privateEndpoints/dpml-dev-mlw001-pe][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_machine_learning_workspace: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.MachineLearningServices/workspaces/dpml-dev-mlw001][0m
[0m[1mazurerm_monitor_diagnostic_setting.diagnostic_setting_machine_learning_workspace: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.MachineLearningServices/workspaces/dpml-dev-mlw001|logAnalytics][0m
[0m[1mazurerm_machine_learning_compute_cluster.machine_learning_compute_cluster_image_build: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.MachineLearningServices/workspaces/dpml-dev-mlw001/computes/imagebuilder001][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
  [33m~[0m update in-place[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # data.azurerm_monitor_diagnostic_categories.diagnostic_categories_cognitive_service[0][0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_cognitive_service" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m logs                = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # data.azurerm_monitor_diagnostic_categories.diagnostic_categories_search_service[0][0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_search_service" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m logs                = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # azapi_resource.cognitive_service_open_ai_model_ada[0][0m will be created
[0m  [32m+[0m[0m resource "azapi_resource" "cognitive_service_open_ai_model_ada" {
      [32m+[0m[0m body                      = jsonencode(
            {
              [32m+[0m[0m properties = {
                  [32m+[0m[0m model                = {
                      [32m+[0m[0m format  = "OpenAI"
                      [32m+[0m[0m name    = "text-embedding-ada-002"
                      [32m+[0m[0m version = "2"
                    }
                  [32m+[0m[0m raiPolicyName        = "Microsoft.Default"
                  [32m+[0m[0m versionUpgradeOption = "OnceNewDefaultVersionAvailable"
                }
              [32m+[0m[0m sku        = {
                  [32m+[0m[0m capacity = 60
                  [32m+[0m[0m name     = "Standard"
                }
            }
        )
      [32m+[0m[0m id                        = (known after apply)
      [32m+[0m[0m ignore_casing             = false
      [32m+[0m[0m ignore_missing_property   = true
      [32m+[0m[0m location                  = (known after apply)
      [32m+[0m[0m name                      = "text-embedding-ada-002"
      [32m+[0m[0m output                    = (known after apply)
      [32m+[0m[0m parent_id                 = (known after apply)
      [32m+[0m[0m removing_special_chars    = false
      [32m+[0m[0m schema_validation_enabled = true
      [32m+[0m[0m tags                      = (known after apply)
      [32m+[0m[0m type                      = "Microsoft.CognitiveServices/accounts/deployments@2023-05-01"
    }

[1m  # azapi_resource.cognitive_service_open_ai_model_gtt_35[0][0m will be created
[0m  [32m+[0m[0m resource "azapi_resource" "cognitive_service_open_ai_model_gtt_35" {
      [32m+[0m[0m body                      = jsonencode(
            {
              [32m+[0m[0m properties = {
                  [32m+[0m[0m model                = {
                      [32m+[0m[0m format  = "OpenAI"
                      [32m+[0m[0m name    = "gpt-35-turbo"
                      [32m+[0m[0m version = "0301"
                    }
                  [32m+[0m[0m raiPolicyName        = "Microsoft.Default"
                  [32m+[0m[0m versionUpgradeOption = "OnceNewDefaultVersionAvailable"
                }
              [32m+[0m[0m sku        = {
                  [32m+[0m[0m capacity = 60
                  [32m+[0m[0m name     = "Standard"
                }
            }
        )
      [32m+[0m[0m id                        = (known after apply)
      [32m+[0m[0m ignore_casing             = false
      [32m+[0m[0m ignore_missing_property   = true
      [32m+[0m[0m location                  = (known after apply)
      [32m+[0m[0m name                      = "gpt-35-turbo"
      [32m+[0m[0m output                    = (known after apply)
      [32m+[0m[0m parent_id                 = (known after apply)
      [32m+[0m[0m removing_special_chars    = false
      [32m+[0m[0m schema_validation_enabled = true
      [32m+[0m[0m tags                      = (known after apply)
      [32m+[0m[0m type                      = "Microsoft.CognitiveServices/accounts/deployments@2023-05-01"
    }

[1m  # azapi_resource.machine_learning_workspace_connection_openai[0][0m will be created
[0m  [32m+[0m[0m resource "azapi_resource" "machine_learning_workspace_connection_openai" {
      [32m+[0m[0m body                      = (sensitive value)
      [32m+[0m[0m id                        = (known after apply)
      [32m+[0m[0m ignore_casing             = false
      [32m+[0m[0m ignore_missing_property   = true
      [32m+[0m[0m location                  = (known after apply)
      [32m+[0m[0m name                      = "dpml-dev-aoai001"
      [32m+[0m[0m output                    = (known after apply)
      [32m+[0m[0m parent_id                 = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.MachineLearningServices/workspaces/dpml-dev-mlw001"
      [32m+[0m[0m removing_special_chars    = false
      [32m+[0m[0m schema_validation_enabled = true
      [32m+[0m[0m tags                      = (known after apply)
      [32m+[0m[0m type                      = "Microsoft.MachineLearningServices/workspaces/connections@2023-06-01-preview"
    }

[1m  # azapi_resource.machine_learning_workspace_connection_search[0][0m will be created
[0m  [32m+[0m[0m resource "azapi_resource" "machine_learning_workspace_connection_search" {
      [32m+[0m[0m body                      = (sensitive value)
      [32m+[0m[0m id                        = (known after apply)
      [32m+[0m[0m ignore_casing             = false
      [32m+[0m[0m ignore_missing_property   = true
      [32m+[0m[0m location                  = (known after apply)
      [32m+[0m[0m name                      = "dpml-dev-srch001"
      [32m+[0m[0m output                    = (known after apply)
      [32m+[0m[0m parent_id                 = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.MachineLearningServices/workspaces/dpml-dev-mlw001"
      [32m+[0m[0m removing_special_chars    = false
      [32m+[0m[0m schema_validation_enabled = true
      [32m+[0m[0m tags                      = (known after apply)
      [32m+[0m[0m type                      = "Microsoft.MachineLearningServices/workspaces/connections@2023-06-01-preview"
    }

[1m  # azapi_update_resource.cognitive_account_update[0][0m will be created
[0m  [32m+[0m[0m resource "azapi_update_resource" "cognitive_account_update" {
      [32m+[0m[0m body                    = jsonencode(
            {
              [32m+[0m[0m properties = {
                  [32m+[0m[0m networkAcls = {
                      [32m+[0m[0m bypass = "AzureServices"
                    }
                }
            }
        )
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m ignore_casing           = false
      [32m+[0m[0m ignore_missing_property = true
      [32m+[0m[0m name                    = (known after apply)
      [32m+[0m[0m output                  = (known after apply)
      [32m+[0m[0m parent_id               = (known after apply)
      [32m+[0m[0m resource_id             = (known after apply)
      [32m+[0m[0m type                    = "Microsoft.CognitiveServices/accounts@2023-10-01-preview"
    }

[1m  # azapi_update_resource.machine_learning_managed_network[0m will be updated in-place
[0m  [33m~[0m[0m resource "azapi_update_resource" "machine_learning_managed_network" {
      [33m~[0m[0m body                    = jsonencode(
            {
              [31m-[0m[0m properties = {
                  [31m-[0m[0m managedNetwork           = {
                      [31m-[0m[0m isolationMode = "AllowOnlyApprovedOutbound"
                      [31m-[0m[0m outboundRules = {
                          [31m-[0m[0m anaconda001        = {
                              [31m-[0m[0m category    = "UserDefined"
                              [31m-[0m[0m destination = "anaconda.com"
                              [31m-[0m[0m status      = "Active"
                              [31m-[0m[0m type        = "FQDN"
                            }
                          [31m-[0m[0m anaconda002        = {
                              [31m-[0m[0m category    = "UserDefined"
                              [31m-[0m[0m destination = "*.anaconda.com"
                              [31m-[0m[0m status      = "Active"
                              [31m-[0m[0m type        = "FQDN"
                            }
                          [31m-[0m[0m anaconda003        = {
                              [31m-[0m[0m category    = "UserDefined"
                              [31m-[0m[0m destination = "*.anaconda.org"
                              [31m-[0m[0m status      = "Active"
                              [31m-[0m[0m type        = "FQDN"
                            }
                          [31m-[0m[0m azure001           = {
                              [31m-[0m[0m category    = "UserDefined"
                              [31m-[0m[0m destination = {
                                  [31m-[0m[0m action     = "Allow"
                                  [31m-[0m[0m portRanges = "443"
                                  [31m-[0m[0m protocol   = "TCP"
                                  [31m-[0m[0m serviceTag = "AzureOpenDatasets"
                                }
                              [31m-[0m[0m status      = "Active"
                              [31m-[0m[0m type        = "ServiceTag"
                            }
                          [31m-[0m[0m docker001          = {
                              [31m-[0m[0m category    = "UserDefined"
                              [31m-[0m[0m destination = "docker.io"
                              [31m-[0m[0m status      = "Active"
                              [31m-[0m[0m type        = "FQDN"
                            }
                          [31m-[0m[0m docker002          = {
                              [31m-[0m[0m category    = "UserDefined"
                              [31m-[0m[0m destination = "*.docker.io"
                              [31m-[0m[0m status      = "Active"
                              [31m-[0m[0m type        = "FQDN"
                            }
                          [31m-[0m[0m docker003          = {
                              [31m-[0m[0m category    = "UserDefined"
                              [31m-[0m[0m destination = "*.docker.com"
                              [31m-[0m[0m status      = "Active"
                              [31m-[0m[0m type        = "FQDN"
                            }
                          [31m-[0m[0m docker004          = {
                              [31m-[0m[0m category    = "UserDefined"
                              [31m-[0m[0m destination = "production.cloudflare.docker.com"
                              [31m-[0m[0m status      = "Active"
                              [31m-[0m[0m type        = "FQDN"
                            }
                          [31m-[0m[0m docker005          = {
                              [31m-[0m[0m category    = "UserDefined"
                              [31m-[0m[0m destination = "cdn.auth0.com"
                              [31m-[0m[0m status      = "Active"
                              [31m-[0m[0m type        = "FQDN"
                            }
                          [31m-[0m[0m dpmldevst001-queue = {
                              [31m-[0m[0m category    = "UserDefined"
                              [31m-[0m[0m destination = {
                                  [31m-[0m[0m serviceResourceId = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Storage/storageAccounts/dpmldevst001"
                                  [31m-[0m[0m sparkEnabled      = true
                                  [31m-[0m[0m sparkStatus       = "Inactive"
                                  [31m-[0m[0m subresourceTarget = "queue"
                                }
                              [31m-[0m[0m status      = "Active"
                              [31m-[0m[0m type        = "PrivateEndpoint"
                            }
                          [31m-[0m[0m dpmldevst001-table = {
                              [31m-[0m[0m category    = "UserDefined"
                              [31m-[0m[0m destination = {
                                  [31m-[0m[0m serviceResourceId = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Storage/storageAccounts/dpmldevst001"
                                  [31m-[0m[0m sparkEnabled      = true
                                  [31m-[0m[0m sparkStatus       = "Inactive"
                                  [31m-[0m[0m subresourceTarget = "table"
                                }
                              [31m-[0m[0m status      = "Active"
                              [31m-[0m[0m type        = "PrivateEndpoint"
                            }
                          [31m-[0m[0m huggingface001     = {
                              [31m-[0m[0m category    = "UserDefined"
                              [31m-[0m[0m destination = "cdn-lfs.huggingface.co"
                              [31m-[0m[0m status      = "Active"
                              [31m-[0m[0m type        = "FQDN"
                            }
                          [31m-[0m[0m maven001           = {
                              [31m-[0m[0m category    = "UserDefined"
                              [31m-[0m[0m destination = "*.maven.org"
                              [31m-[0m[0m status      = "Active"
                              [31m-[0m[0m type        = "FQDN"
                            }
                          [31m-[0m[0m openai001          = {
                              [31m-[0m[0m category    = "UserDefined"
                              [31m-[0m[0m destination = "openaipublic.blob.core.windows.net"
                              [31m-[0m[0m status      = "Active"
                              [31m-[0m[0m type        = "FQDN"
                            }
                          [31m-[0m[0m pypi001            = {
                              [31m-[0m[0m category    = "UserDefined"
                              [31m-[0m[0m destination = "pypi.org"
                              [31m-[0m[0m status      = "Active"
                              [31m-[0m[0m type        = "FQDN"
                            }
                          [31m-[0m[0m pypi002            = {
                              [31m-[0m[0m category    = "UserDefined"
                              [31m-[0m[0m destination = "pythonhosted.org"
                              [31m-[0m[0m status      = "Active"
                              [31m-[0m[0m type        = "FQDN"
                            }
                          [31m-[0m[0m pypi003            = {
                              [31m-[0m[0m category    = "UserDefined"
                              [31m-[0m[0m destination = "*.pythonhosted.org"
                              [31m-[0m[0m status      = "Active"
                              [31m-[0m[0m type        = "FQDN"
                            }
                          [31m-[0m[0m pypi004            = {
                              [31m-[0m[0m category    = "UserDefined"
                              [31m-[0m[0m destination = "pypi.python.org"
                              [31m-[0m[0m status      = "Active"
                              [31m-[0m[0m type        = "FQDN"
                            }
                          [31m-[0m[0m pytorch001         = {
                              [31m-[0m[0m category    = "UserDefined"
                              [31m-[0m[0m destination = "pytorch.org"
                              [31m-[0m[0m status      = "Active"
                              [31m-[0m[0m type        = "FQDN"
                            }
                          [31m-[0m[0m pytorch002         = {
                              [31m-[0m[0m category    = "UserDefined"
                              [31m-[0m[0m destination = "*.pytorch.org"
                              [31m-[0m[0m status      = "Active"
                              [31m-[0m[0m type        = "FQDN"
                            }
                          [31m-[0m[0m r001               = {
                              [31m-[0m[0m category    = "UserDefined"
                              [31m-[0m[0m destination = "cloud.r-project.org"
                              [31m-[0m[0m status      = "Active"
                              [31m-[0m[0m type        = "FQDN"
                            }
                          [31m-[0m[0m tensorflow001      = {
                              [31m-[0m[0m category    = "UserDefined"
                              [31m-[0m[0m destination = "*.tensorflow.org"
                              [31m-[0m[0m status      = "Active"
                              [31m-[0m[0m type        = "FQDN"
                            }
                          [31m-[0m[0m vscode001          = {
                              [31m-[0m[0m category    = "UserDefined"
                              [31m-[0m[0m destination = "update.code.visualstudio.com"
                              [31m-[0m[0m status      = "Active"
                              [31m-[0m[0m type        = "FQDN"
                            }
                          [31m-[0m[0m vscode002          = {
                              [31m-[0m[0m category    = "UserDefined"
                              [31m-[0m[0m destination = "*.vo.msecnd.net"
                              [31m-[0m[0m status      = "Active"
                              [31m-[0m[0m type        = "FQDN"
                            }
                          [31m-[0m[0m vscode003          = {
                              [31m-[0m[0m category    = "UserDefined"
                              [31m-[0m[0m destination = "marketplace.visualstudio.com"
                              [31m-[0m[0m status      = "Active"
                              [31m-[0m[0m type        = "FQDN"
                            }
                          [31m-[0m[0m vscode004          = {
                              [31m-[0m[0m category    = "UserDefined"
                              [31m-[0m[0m destination = "vscode.blob.core.windows.net"
                              [31m-[0m[0m status      = "Active"
                              [31m-[0m[0m type        = "FQDN"
                            }
                          [31m-[0m[0m vscode005          = {
                              [31m-[0m[0m category    = "UserDefined"
                              [31m-[0m[0m destination = "*.gallerycdn.vsassets.io"
                              [31m-[0m[0m status      = "Active"
                              [31m-[0m[0m type        = "FQDN"
                            }
                          [31m-[0m[0m vscode006          = {
                              [31m-[0m[0m category    = "UserDefined"
                              [31m-[0m[0m destination = "raw.githubusercontent.com"
                              [31m-[0m[0m status      = "Active"
                              [31m-[0m[0m type        = "FQDN"
                            }
                          [31m-[0m[0m vscode007          = {
                              [31m-[0m[0m category    = "UserDefined"
                              [31m-[0m[0m destination = "*.vscode.dev"
                              [31m-[0m[0m status      = "Active"
                              [31m-[0m[0m type        = "FQDN"
                            }
                          [31m-[0m[0m vscode008          = {
                              [31m-[0m[0m category    = "UserDefined"
                              [31m-[0m[0m destination = "*.vscode-cdn.net"
                              [31m-[0m[0m status      = "Active"
                              [31m-[0m[0m type        = "FQDN"
                            }
                          [31m-[0m[0m vscode009          = {
                              [31m-[0m[0m category    = "UserDefined"
                              [31m-[0m[0m destination = "*.vscodeexperiments.azureedge.net"
                              [31m-[0m[0m status      = "Active"
                              [31m-[0m[0m type        = "FQDN"
                            }
                          [31m-[0m[0m vscode010          = {
                              [31m-[0m[0m category    = "UserDefined"
                              [31m-[0m[0m destination = "default.exp-tas.com"
                              [31m-[0m[0m status      = "Active"
                              [31m-[0m[0m type        = "FQDN"
                            }
                          [31m-[0m[0m vscode011          = {
                              [31m-[0m[0m category    = "UserDefined"
                              [31m-[0m[0m destination = "code.visualstudio.com"
                              [31m-[0m[0m status      = "Active"
                              [31m-[0m[0m type        = "FQDN"
                            }
                          [31m-[0m[0m vscode012          = {
                              [31m-[0m[0m category    = "UserDefined"
                              [31m-[0m[0m destination = "*.gallery.vsassets.io"
                              [31m-[0m[0m status      = "Active"
                              [31m-[0m[0m type        = "FQDN"
                            }
                          [31m-[0m[0m vscode013          = {
                              [31m-[0m[0m category    = "UserDefined"
                              [31m-[0m[0m destination = "vscode.search.windows.net"
                              [31m-[0m[0m status      = "Active"
                              [31m-[0m[0m type        = "FQDN"
                            }
                          [31m-[0m[0m vscode014          = {
                              [31m-[0m[0m category    = "UserDefined"
                              [31m-[0m[0m destination = "vsmarketplacebadges.dev"
                              [31m-[0m[0m status      = "Active"
                              [31m-[0m[0m type        = "FQDN"
                            }
                          [31m-[0m[0m vscode015          = {
                              [31m-[0m[0m category    = "UserDefined"
                              [31m-[0m[0m destination = "vscode.download.prss.microsoft.com"
                              [31m-[0m[0m status      = "Active"
                              [31m-[0m[0m type        = "FQDN"
                            }
                          [31m-[0m[0m vscode016          = {
                              [31m-[0m[0m category    = "UserDefined"
                              [31m-[0m[0m destination = "download.visualstudio.microsoft.com"
                              [31m-[0m[0m status      = "Active"
                              [31m-[0m[0m type        = "FQDN"
                            }
                          [31m-[0m[0m vscode017          = {
                              [31m-[0m[0m category    = "UserDefined"
                              [31m-[0m[0m destination = "vscode-sync.trafficmanager.net"
                              [31m-[0m[0m status      = "Active"
                              [31m-[0m[0m type        = "FQDN"
                            }
                          [31m-[0m[0m vscode018          = {
                              [31m-[0m[0m category    = "UserDefined"
                              [31m-[0m[0m destination = "vscode.dev"
                              [31m-[0m[0m status      = "Active"
                              [31m-[0m[0m type        = "FQDN"
                            }
                          [31m-[0m[0m vscode019          = {
                              [31m-[0m[0m category    = "UserDefined"
                              [31m-[0m[0m destination = "*.vscode-unpkg.net"
                              [31m-[0m[0m status      = "Active"
                              [31m-[0m[0m type        = "FQDN"
                            }
                        }
                      [31m-[0m[0m status        = {
                          [31m-[0m[0m sparkReady = false
                          [31m-[0m[0m status     = "Active"
                        }
                    }
                  [31m-[0m[0m systemDatastoresAuthMode = "identity"
                }
            }
        ) -> (known after apply)
        id                      = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.MachineLearningServices/workspaces/dpml-dev-mlw001"
        name                    = "dpml-dev-mlw001"
      [33m~[0m[0m output                  = jsonencode({}) -> (known after apply)
        [90m# (5 unchanged attributes hidden)[0m[0m
    }

[1m  # azurerm_cognitive_account.cognitive_account_openai[0][0m will be created
[0m  [32m+[0m[0m resource "azurerm_cognitive_account" "cognitive_account_openai" {
      [32m+[0m[0m custom_subdomain_name              = "dpml-dev-cog001"
      [32m+[0m[0m dynamic_throttling_enabled         = false
      [32m+[0m[0m endpoint                           = (known after apply)
      [32m+[0m[0m fqdns                              = [
          [32m+[0m[0m "dpmldevst001.blob.core.windows.net",
          [32m+[0m[0m "dpml-dev-srch001.search.windows.net",
        ]
      [32m+[0m[0m id                                 = (known after apply)
      [32m+[0m[0m kind                               = "OpenAI"
      [32m+[0m[0m local_auth_enabled                 = true
      [32m+[0m[0m location                           = "northeurope"
      [32m+[0m[0m name                               = "dpml-dev-aoai001"
      [32m+[0m[0m outbound_network_access_restricted = true
      [32m+[0m[0m primary_access_key                 = (sensitive value)
      [32m+[0m[0m public_network_access_enabled      = true
      [32m+[0m[0m resource_group_name                = "myprod-dev-analytics-rg"
      [32m+[0m[0m secondary_access_key               = (sensitive value)
      [32m+[0m[0m sku_name                           = "S0"

      [32m+[0m[0m identity {
          [32m+[0m[0m principal_id = (known after apply)
          [32m+[0m[0m tenant_id    = (known after apply)
          [32m+[0m[0m type         = "SystemAssigned"
        }

      [32m+[0m[0m network_acls {
          [32m+[0m[0m default_action = "Deny"
        }
    }

[1m  # azurerm_monitor_diagnostic_setting.diagnostic_setting_cognitive_service[0][0m will be created
[0m  [32m+[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_cognitive_service" {
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m log_analytics_destination_type = (known after apply)
      [32m+[0m[0m log_analytics_workspace_id     = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.OperationalInsights/workspaces/dpml-dev-log001"
      [32m+[0m[0m name                           = "logAnalytics"
      [32m+[0m[0m target_resource_id             = (known after apply)
    }

[1m  # azurerm_monitor_diagnostic_setting.diagnostic_setting_search_service[0][0m will be created
[0m  [32m+[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_search_service" {
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m log_analytics_destination_type = (known after apply)
      [32m+[0m[0m log_analytics_workspace_id     = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.OperationalInsights/workspaces/dpml-dev-log001"
      [32m+[0m[0m name                           = "logAnalytics"
      [32m+[0m[0m target_resource_id             = (known after apply)
    }

[1m  # azurerm_private_endpoint.cognitive_service_private_endpoint[0][0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "cognitive_service_private_endpoint" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "dpml-dev-aoai001-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "dpml-dev-aoai001-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "myprod-dev-analytics-rg"
      [32m+[0m[0m subnet_id                     = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-logic-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-logic-vnet001/subnets/PeSubnet"

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "dpml-dev-aoai001-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.openai.azure.com",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "dpml-dev-aoai001-pe"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "account",
            ]
        }
    }

[1m  # azurerm_private_endpoint.search_service_private_endpoint[0][0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "search_service_private_endpoint" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "dpml-dev-srch001-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "dpml-dev-srch001-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "myprod-dev-analytics-rg"
      [32m+[0m[0m subnet_id                     = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-logic-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-logic-vnet001/subnets/PeSubnet"

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "dpml-dev-srch001-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.search.windows.net",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "dpml-dev-srch001-pe"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "searchService",
            ]
        }
    }

[1m  # azurerm_role_assignment.cognitive_account_openai_role_assignment_search_index_data_reader[0][0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "cognitive_account_openai_role_assignment_search_index_data_reader" {
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = (known after apply)
      [32m+[0m[0m principal_type                   = (known after apply)
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Search Index Data Reader"
      [32m+[0m[0m scope                            = (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # azurerm_role_assignment.cognitive_account_openai_role_assignment_search_service_contributor[0][0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "cognitive_account_openai_role_assignment_search_service_contributor" {
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = (known after apply)
      [32m+[0m[0m principal_type                   = (known after apply)
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Search Service Contributor"
      [32m+[0m[0m scope                            = (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # azurerm_role_assignment.cognitive_account_openai_role_assignment_storage_blob_contributor[0][0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "cognitive_account_openai_role_assignment_storage_blob_contributor" {
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = (known after apply)
      [32m+[0m[0m principal_type                   = (known after apply)
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Storage Blob Data Contributor"
      [32m+[0m[0m scope                            = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Storage/storageAccounts/dpmldevst001"
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # azurerm_role_assignment.search_role_assignment_openai_contributor[0][0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "search_role_assignment_openai_contributor" {
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = (known after apply)
      [32m+[0m[0m principal_type                   = (known after apply)
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Cognitive Services OpenAI Contributor"
      [32m+[0m[0m scope                            = (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # azurerm_role_assignment.search_role_assignment_storage_blob_contributor[0][0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "search_role_assignment_storage_blob_contributor" {
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = (known after apply)
      [32m+[0m[0m principal_type                   = (known after apply)
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Storage Blob Data Contributor"
      [32m+[0m[0m scope                            = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Storage/storageAccounts/dpmldevst001"
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # azurerm_role_assignment.search_role_assignment_storage_reader_and_data_access[0][0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "search_role_assignment_storage_reader_and_data_access" {
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = (known after apply)
      [32m+[0m[0m principal_type                   = (known after apply)
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Reader and Data Access"
      [32m+[0m[0m scope                            = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Storage/storageAccounts/dpmldevst001"
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # azurerm_role_assignment.uai_role_assignment_cognitive_account_openai_contributor[0][0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "uai_role_assignment_cognitive_account_openai_contributor" {
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = "de97da98-9528-4459-8115-e0d56ed0c728"
      [32m+[0m[0m principal_type                   = (known after apply)
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Contributor"
      [32m+[0m[0m scope                            = (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # azurerm_role_assignment.uai_role_assignment_search_service_contributor[0][0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "uai_role_assignment_search_service_contributor" {
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = "de97da98-9528-4459-8115-e0d56ed0c728"
      [32m+[0m[0m principal_type                   = (known after apply)
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Contributor"
      [32m+[0m[0m scope                            = (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # azurerm_search_service.search_service[0][0m will be created
[0m  [32m+[0m[0m resource "azurerm_search_service" "search_service" {
      [32m+[0m[0m authentication_failure_mode              = "http401WithBearerChallenge"
      [32m+[0m[0m customer_managed_key_enforcement_enabled = false
      [32m+[0m[0m hosting_mode                             = "default"
      [32m+[0m[0m id                                       = (known after apply)
      [32m+[0m[0m local_authentication_enabled             = true
      [32m+[0m[0m location                                 = "northeurope"
      [32m+[0m[0m name                                     = "dpml-dev-srch001"
      [32m+[0m[0m partition_count                          = 1
      [32m+[0m[0m primary_key                              = (sensitive value)
      [32m+[0m[0m public_network_access_enabled            = false
      [32m+[0m[0m query_keys                               = (known after apply)
      [32m+[0m[0m replica_count                            = 1
      [32m+[0m[0m resource_group_name                      = "myprod-dev-analytics-rg"
      [32m+[0m[0m secondary_key                            = (sensitive value)
      [32m+[0m[0m sku                                      = "basic"

      [32m+[0m[0m identity {
          [32m+[0m[0m principal_id = (known after apply)
          [32m+[0m[0m tenant_id    = (known after apply)
          [32m+[0m[0m type         = "SystemAssigned"
        }
    }

[1m  # azurerm_storage_account.storage[0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_storage_account" "storage" {
        id                                = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/myprod-dev-analytics-rg/providers/Microsoft.Storage/storageAccounts/dpmldevst001"
        name                              = "dpmldevst001"
        tags                              = {}
        [90m# (40 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m network_rules {
            [90m# (4 unchanged attributes hidden)[0m[0m

          [33m~[0m[0m private_link_access {
              [33m~[0m[0m endpoint_resource_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourcegroups/*/providers/Microsoft.MachineLearningServices/workspaces/*" [33m->[0m[0m "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourcegroups/*/providers/Microsoft.Synapse/workspaces/*"
                [90m# (1 unchanged attribute hidden)[0m[0m
            }
          [33m~[0m[0m private_link_access {
              [33m~[0m[0m endpoint_resource_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourcegroups/*/providers/Microsoft.Synapse/workspaces/*" [33m->[0m[0m "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourcegroups/*/providers/Microsoft.MachineLearningServices/workspaces/*"
                [90m# (1 unchanged attribute hidden)[0m[0m
            }
          [31m-[0m[0m private_link_access {
              [31m-[0m[0m endpoint_resource_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/providers/Microsoft.Security/datascanners/storageDataScanner" [90m-> null[0m[0m
              [31m-[0m[0m endpoint_tenant_id   = "3556be79-2979-4b19-a1af-4dd4e6d9ed7e" [90m-> null[0m[0m
            }
          [31m-[0m[0m private_link_access {
              [31m-[0m[0m endpoint_resource_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourcegroups/*/providers/Microsoft.MachineLearningServices/registries/*" [90m-> null[0m[0m
              [31m-[0m[0m endpoint_tenant_id   = "3556be79-2979-4b19-a1af-4dd4e6d9ed7e" [90m-> null[0m[0m
            }

            [90m# (1 unchanged block hidden)[0m[0m
        }

        [90m# (4 unchanged blocks hidden)[0m[0m
    }

[1mPlan:[0m 19 to add, 2 to change, 0 to destroy.
[0m[33m╷[0m[0m
[33m│[0m [0m[1m[33mWarning: [0m[0m[1mArgument is deprecated[0m
[33m│[0m [0m
[33m│[0m [0m[0m  with azurerm_container_registry.container_registry,
[33m│[0m [0m  on containerregistry.tf line 1, in resource "azurerm_container_registry" "container_registry":
[33m│[0m [0m   1: resource "azurerm_container_registry" "container_registry" [4m{[0m[0m
[33m│[0m [0m
[33m│[0m [0m This is only used exclusively for service endpoints (which is a feature being deprecated). Users are expected to use Private Endpoints instead
[33m│[0m [0m
[33m│[0m [0m(and one more similar warning elsewhere)
[33m╵[0m[0m
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>